create_generated_clock -name pll_bank11_nand_phy_clk -source [get_pins sys_top_i/pll_bank11/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_0 [get_pins sys_top_i/pll_bank11/clk_out1]
create_generated_clock -name pll_bank12_nand_phy_clk -source [get_pins sys_top_i/pll_bank12/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_0 [get_pins sys_top_i/pll_bank12/clk_out1]
create_generated_clock -name pll_bank13_nand_phy_clk -source [get_pins sys_top_i/pll_bank13/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_0 [get_pins sys_top_i/pll_bank13/clk_out1]
create_generated_clock -name pll_bank33_nand_phy_clk -source [get_pins sys_top_i/pll_bank33/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_1 [get_pins sys_top_i/pll_bank33/clk_out1]
create_generated_clock -name pll_bank34_nand_phy_clk -source [get_pins sys_top_i/pll_bank34/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_1 [get_pins sys_top_i/pll_bank34/clk_out1]
create_generated_clock -name pll_bank35_nand_phy_clk -source [get_pins sys_top_i/pll_bank35/clk_in1] -multiply_by 2 -add -master_clock clk_fpga_1 [get_pins sys_top_i/pll_bank35/clk_out1]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_0/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X0Y11 [get_cells sys_top_i/v2nfc_0/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch0_virt_clk
create_clock -period 15 -name nand_ch0_dqs_as_clk [get_ports nand_if_0_nand_dqs_p]
set_clock_uncertainty 0.700 [get_clocks nand_ch0_dqs_as_clk]
set_clock_latency -source -0.000 [get_clocks nand_ch0_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch0_virt_clk] -rise_to [get_clocks nand_ch0_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch0_virt_clk] -fall_to [get_clocks nand_ch0_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch0_virt_clk] -rise_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch0_virt_clk] -fall_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch0_virt_clk] -rise_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch0_virt_clk] -fall_to [get_clocks nand_ch0_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch0_virt_clk] -max 0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch0_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch0_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch0_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch0_dqs_as_clk] -max 0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch0_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch0_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_0_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch0_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_0_nand_dq[*]}]
create_generated_clock -name nand_ch0_weo_clk -source [get_pins sys_top_i/v2nfc_0/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank11_nand_phy_clk [get_ports nand_if_0_nand_we]
set_output_delay -clock [get_clocks nand_ch0_weo_clk] 0.900 [get_ports {nand_if_0_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch0_weo_clk] 0.900 [get_ports nand_if_0_nand_ale]
set_output_delay -clock [get_clocks nand_ch0_weo_clk] 0.900 [get_ports nand_if_0_nand_cle]
set_output_delay -clock [get_clocks nand_ch0_weo_clk] 0.900 [get_ports {nand_if_0_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch0_weo_clk] -rise_to [get_clocks pll_bank11_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch0_weo_clk] -fall_to [get_clocks pll_bank11_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch0_dqs_as_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch0_weo_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch0_weo_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch0_weo_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch0_weo_clk]
set_property IODELAY_GROUP BANK_0_IODELAY_GROUP [get_cells sys_top_i/v2nfc_0/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_0_IODELAY_GROUP [get_cells sys_top_i/v2nfc_0/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_1/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X0Y8 [get_cells sys_top_i/v2nfc_1/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch1_virt_clk
create_clock -period 15 -name nand_ch1_dqs_as_clk [get_ports nand_if_1_nand_dqs_p]
set_clock_uncertainty 0.700 [get_clocks nand_ch1_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch1_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch1_virt_clk] -rise_to [get_clocks nand_ch1_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch1_virt_clk] -fall_to [get_clocks nand_ch1_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch1_virt_clk] -rise_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch1_virt_clk] -fall_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch1_virt_clk] -rise_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch1_virt_clk] -fall_to [get_clocks nand_ch1_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch1_virt_clk] -max 0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch1_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch1_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch1_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch1_dqs_as_clk] -max 0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch1_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch1_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_1_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch1_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_1_nand_dq[*]}]
create_generated_clock -name nand_ch1_weo_clk -source [get_pins sys_top_i/v2nfc_1/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank11_nand_phy_clk [get_ports nand_if_1_nand_we]
set_output_delay -clock [get_clocks nand_ch1_weo_clk] 0.900 [get_ports {nand_if_1_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch1_weo_clk] 0.900 [get_ports nand_if_1_nand_ale]
set_output_delay -clock [get_clocks nand_ch1_weo_clk] 0.900 [get_ports nand_if_1_nand_cle]
set_output_delay -clock [get_clocks nand_ch1_weo_clk] 0.900 [get_ports {nand_if_1_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch1_weo_clk] -rise_to [get_clocks pll_bank11_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch1_weo_clk] -fall_to [get_clocks pll_bank11_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch1_dqs_as_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch1_weo_clk]
set_false_path -setup -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch1_weo_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -rise_to [get_clocks nand_ch1_weo_clk]
set_false_path -hold -fall_from pll_bank11_nand_phy_clk -fall_to [get_clocks nand_ch1_weo_clk]
set_property IODELAY_GROUP BANK_0_IODELAY_GROUP [get_cells sys_top_i/v2nfc_1/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_2/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X0Y12 [get_cells sys_top_i/v2nfc_2/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch2_virt_clk
create_clock -period 15 -name nand_ch2_dqs_as_clk [get_ports nand_if_2_nand_dqs_p]
set_clock_uncertainty 0.600 [get_clocks nand_ch2_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch2_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch2_virt_clk] -rise_to [get_clocks nand_ch2_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch2_virt_clk] -fall_to [get_clocks nand_ch2_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch2_virt_clk] -rise_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch2_virt_clk] -fall_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch2_virt_clk] -rise_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch2_virt_clk] -fall_to [get_clocks nand_ch2_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch2_virt_clk] -max 0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch2_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch2_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch2_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch2_dqs_as_clk] -max 0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch2_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch2_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_2_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch2_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_2_nand_dq[*]}]
create_generated_clock -name nand_ch2_weo_clk -source [get_pins sys_top_i/v2nfc_2/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank12_nand_phy_clk [get_ports nand_if_2_nand_we]
set_output_delay -clock [get_clocks nand_ch2_weo_clk] 0.900 [get_ports {nand_if_2_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch2_weo_clk] 0.900 [get_ports nand_if_2_nand_ale]
set_output_delay -clock [get_clocks nand_ch2_weo_clk] 0.900 [get_ports nand_if_2_nand_cle]
set_output_delay -clock [get_clocks nand_ch2_weo_clk] 0.900 [get_ports {nand_if_2_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch2_weo_clk] -rise_to [get_clocks pll_bank12_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch2_weo_clk] -fall_to [get_clocks pll_bank12_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank12_nand_phy_clk -rise_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -setup -fall_from pll_bank12_nand_phy_clk -fall_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -hold -fall_from pll_bank12_nand_phy_clk -rise_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -hold -fall_from pll_bank12_nand_phy_clk -fall_to [get_clocks nand_ch2_dqs_as_clk]
set_false_path -setup -fall_from pll_bank12_nand_phy_clk -rise_to [get_clocks nand_ch2_weo_clk]
set_false_path -setup -fall_from pll_bank12_nand_phy_clk -fall_to [get_clocks nand_ch2_weo_clk]
set_false_path -hold -fall_from pll_bank12_nand_phy_clk -rise_to [get_clocks nand_ch2_weo_clk]
set_false_path -hold -fall_from pll_bank12_nand_phy_clk -fall_to [get_clocks nand_ch2_weo_clk]
set_property IODELAY_GROUP BANK_2_IODELAY_GROUP [get_cells sys_top_i/v2nfc_2/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_2_IODELAY_GROUP [get_cells sys_top_i/v2nfc_2/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_3/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X0Y19 [get_cells sys_top_i/v2nfc_3/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch3_virt_clk
create_clock -period 15 -name nand_ch3_dqs_as_clk [get_ports nand_if_3_nand_dqs_p]
set_clock_uncertainty 0.600 [get_clocks nand_ch3_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch3_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch3_virt_clk] -rise_to [get_clocks nand_ch3_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch3_virt_clk] -fall_to [get_clocks nand_ch3_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch3_virt_clk] -rise_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch3_virt_clk] -fall_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch3_virt_clk] -rise_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch3_virt_clk] -fall_to [get_clocks nand_ch3_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch3_virt_clk] -max 0.850 [get_ports {nand_if_3_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch3_virt_clk] -clock_fall -max -add_delay 0.850 [get_ports {nand_if_3_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch3_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_3_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch3_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_3_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch3_dqs_as_clk] -max 0.900 [get_ports {nand_if_3_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch3_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_3_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch3_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_3_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch3_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_3_nand_dq[*]}]
create_generated_clock -name nand_ch3_weo_clk -source [get_pins sys_top_i/v2nfc_3/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank13_nand_phy_clk [get_ports nand_if_3_nand_we]
set_output_delay -clock [get_clocks nand_ch3_weo_clk] 0.900 [get_ports {nand_if_3_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch3_weo_clk] 0.900 [get_ports nand_if_3_nand_ale]
set_output_delay -clock [get_clocks nand_ch3_weo_clk] 0.900 [get_ports nand_if_3_nand_cle]
set_output_delay -clock [get_clocks nand_ch3_weo_clk] 0.900 [get_ports {nand_if_3_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch3_weo_clk] -rise_to [get_clocks pll_bank13_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch3_weo_clk] -fall_to [get_clocks pll_bank13_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank13_nand_phy_clk -rise_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -setup -fall_from pll_bank13_nand_phy_clk -fall_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -hold -fall_from pll_bank13_nand_phy_clk -rise_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -hold -fall_from pll_bank13_nand_phy_clk -fall_to [get_clocks nand_ch3_dqs_as_clk]
set_false_path -setup -fall_from pll_bank13_nand_phy_clk -rise_to [get_clocks nand_ch3_weo_clk]
set_false_path -setup -fall_from pll_bank13_nand_phy_clk -fall_to [get_clocks nand_ch3_weo_clk]
set_false_path -hold -fall_from pll_bank13_nand_phy_clk -rise_to [get_clocks nand_ch3_weo_clk]
set_false_path -hold -fall_from pll_bank13_nand_phy_clk -fall_to [get_clocks nand_ch3_weo_clk]
set_property IODELAY_GROUP BANK_3_IODELAY_GROUP [get_cells sys_top_i/v2nfc_3/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_3_IODELAY_GROUP [get_cells sys_top_i/v2nfc_3/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_4/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X1Y19 [get_cells sys_top_i/v2nfc_4/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch4_virt_clk
create_clock -period 15 -name nand_ch4_dqs_as_clk [get_ports nand_if_4_nand_dqs_p]
set_clock_uncertainty 0.600 [get_clocks nand_ch4_dqs_as_clk]
set_clock_latency -source 00.000 [get_clocks nand_ch4_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch4_virt_clk] -rise_to [get_clocks nand_ch4_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch4_virt_clk] -fall_to [get_clocks nand_ch4_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch4_virt_clk] -rise_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch4_virt_clk] -fall_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch4_virt_clk] -rise_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch4_virt_clk] -fall_to [get_clocks nand_ch4_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch4_virt_clk] -max 0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch4_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch4_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch4_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch4_dqs_as_clk] -max 0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch4_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch4_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_4_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch4_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_4_nand_dq[*]}]
create_generated_clock -name nand_ch4_weo_clk -source [get_pins sys_top_i/v2nfc_4/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank33_nand_phy_clk [get_ports nand_if_4_nand_we]
set_output_delay -clock [get_clocks nand_ch4_weo_clk] 0.900 [get_ports {nand_if_4_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch4_weo_clk] 0.900 [get_ports nand_if_4_nand_ale]
set_output_delay -clock [get_clocks nand_ch4_weo_clk] 0.900 [get_ports nand_if_4_nand_cle]
set_output_delay -clock [get_clocks nand_ch4_weo_clk] 0.900 [get_ports {nand_if_4_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch4_weo_clk] -rise_to [get_clocks pll_bank33_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch4_weo_clk] -fall_to [get_clocks pll_bank33_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch4_dqs_as_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch4_weo_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch4_weo_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch4_weo_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch4_weo_clk]
set_property IODELAY_GROUP BANK_4_IODELAY_GROUP [get_cells sys_top_i/v2nfc_4/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_4_IODELAY_GROUP [get_cells sys_top_i/v2nfc_4/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_5/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X1Y16 [get_cells sys_top_i/v2nfc_5/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch5_virt_clk
create_clock -period 15 -name nand_ch5_dqs_as_clk [get_ports nand_if_5_nand_dqs_p]
set_clock_uncertainty 0.600 [get_clocks nand_ch5_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch5_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch5_virt_clk] -rise_to [get_clocks nand_ch5_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch5_virt_clk] -fall_to [get_clocks nand_ch5_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch5_virt_clk] -rise_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch5_virt_clk] -fall_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch5_virt_clk] -rise_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch5_virt_clk] -fall_to [get_clocks nand_ch5_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch5_virt_clk] -max 0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch5_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch5_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch5_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch5_dqs_as_clk] -max 0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch5_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch5_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_5_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch5_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_5_nand_dq[*]}]
create_generated_clock -name nand_ch5_weo_clk -source [get_pins sys_top_i/v2nfc_5/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank33_nand_phy_clk [get_ports nand_if_5_nand_we]
set_output_delay -clock [get_clocks nand_ch5_weo_clk] 0.900 [get_ports {nand_if_5_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch5_weo_clk] 0.900 [get_ports nand_if_5_nand_ale]
set_output_delay -clock [get_clocks nand_ch5_weo_clk] 0.900 [get_ports nand_if_5_nand_cle]
set_output_delay -clock [get_clocks nand_ch5_weo_clk] 0.900 [get_ports {nand_if_5_nand_dq[*]}]
#set_multicycle_path -setup -end -rise_from [get_clocks nand_ch5_weo_clk] -rise_to [get_clocks pll_bank33_nand_phy_clk] 0
#set_multicycle_path -setup -end -fall_from [get_clocks nand_ch5_weo_clk] -fall_to [get_clocks pll_bank33_nand_phy_clk] 0
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch5_dqs_as_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch5_weo_clk]
set_false_path -setup -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch5_weo_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -rise_to [get_clocks nand_ch5_weo_clk]
set_false_path -hold -fall_from pll_bank33_nand_phy_clk -fall_to [get_clocks nand_ch5_weo_clk]
set_property IODELAY_GROUP BANK_4_IODELAY_GROUP [get_cells sys_top_i/v2nfc_5/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_6/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X1Y20 [get_cells sys_top_i/v2nfc_6/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch6_virt_clk
create_clock -period 15 -name nand_ch6_dqs_as_clk [get_ports nand_if_6_nand_dqs_p]
set_clock_uncertainty 0.700 [get_clocks nand_ch6_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch6_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch6_virt_clk] -rise_to [get_clocks nand_ch6_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch6_virt_clk] -fall_to [get_clocks nand_ch6_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch6_virt_clk] -rise_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch6_virt_clk] -fall_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch6_virt_clk] -rise_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch6_virt_clk] -fall_to [get_clocks nand_ch6_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch6_virt_clk] -max 0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch6_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch6_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch6_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch6_dqs_as_clk] -max 0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch6_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch6_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch6_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_6_nand_dq[*]}]
create_generated_clock -name nand_ch6_weo_clk -source [get_pins sys_top_i/v2nfc_6/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank34_nand_phy_clk [get_ports nand_if_6_nand_we]
set_output_delay -clock [get_clocks nand_ch6_weo_clk] 0.900 [get_ports {nand_if_6_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch6_weo_clk] 0.900 [get_ports nand_if_6_nand_ale]
set_output_delay -clock [get_clocks nand_ch6_weo_clk] 0.900 [get_ports nand_if_6_nand_cle]
set_output_delay -clock [get_clocks nand_ch6_weo_clk] 0.900 [get_ports {nand_if_6_nand_dq[*]}]
set_false_path -setup -fall_from pll_bank34_nand_phy_clk -rise_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -setup -fall_from pll_bank34_nand_phy_clk -fall_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -hold -fall_from pll_bank34_nand_phy_clk -rise_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -hold -fall_from pll_bank34_nand_phy_clk -fall_to [get_clocks nand_ch6_dqs_as_clk]
set_false_path -setup -fall_from pll_bank34_nand_phy_clk -rise_to [get_clocks nand_ch6_weo_clk]
set_false_path -setup -fall_from pll_bank34_nand_phy_clk -fall_to [get_clocks nand_ch6_weo_clk]
set_false_path -hold -fall_from pll_bank34_nand_phy_clk -rise_to [get_clocks nand_ch6_weo_clk]
set_false_path -hold -fall_from pll_bank34_nand_phy_clk -fall_to [get_clocks nand_ch6_weo_clk]
set_property IODELAY_GROUP BANK_6_IODELAY_GROUP [get_cells sys_top_i/v2nfc_6/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_6_IODELAY_GROUP [get_cells sys_top_i/v2nfc_6/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]
set_property BEL IN_FIFO [get_cells sys_top_i/v2nfc_7/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
set_property LOC IN_FIFO_X1Y25 [get_cells sys_top_i/v2nfc_7/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQINFIFO4x4]
create_clock -period 15 -name nand_ch7_virt_clk
create_clock -period 15 -name nand_ch7_dqs_as_clk [get_ports nand_if_7_nand_dqs_p]
set_clock_uncertainty 0.600 [get_clocks nand_ch7_dqs_as_clk]
set_clock_latency -source 0.000 [get_clocks nand_ch7_dqs_as_clk]
set_multicycle_path -setup -end -rise_from [get_clocks nand_ch7_virt_clk] -rise_to [get_clocks nand_ch7_dqs_as_clk] 0
set_multicycle_path -setup -end -fall_from [get_clocks nand_ch7_virt_clk] -fall_to [get_clocks nand_ch7_dqs_as_clk] 0
set_false_path -setup -fall_from [get_clocks nand_ch7_virt_clk] -rise_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -setup -rise_from [get_clocks nand_ch7_virt_clk] -fall_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -hold -rise_from [get_clocks nand_ch7_virt_clk] -rise_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -hold -fall_from [get_clocks nand_ch7_virt_clk] -fall_to [get_clocks nand_ch7_dqs_as_clk]
set_input_delay -clock [get_clocks nand_ch7_virt_clk] -max 0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch7_virt_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch7_virt_clk] -min -add_delay -0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_input_delay -clock [get_clocks nand_ch7_virt_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch7_dqs_as_clk] -max 0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch7_dqs_as_clk] -clock_fall -max -add_delay 0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch7_dqs_as_clk] -min -add_delay -0.900 [get_ports {nand_if_7_nand_dq[*]}]
set_output_delay -clock [get_clocks nand_ch7_dqs_as_clk] -clock_fall -min -add_delay -0.900 [get_ports {nand_if_7_nand_dq[*]}]
create_generated_clock -name nand_ch7_weo_clk -source [get_pins sys_top_i/v2nfc_7/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Output/Inst_WEOSERDES/OQ] -edges {1 3 5} -add -master_clock pll_bank35_nand_phy_clk [get_ports nand_if_7_nand_we]
set_output_delay -clock [get_clocks nand_ch7_weo_clk] 0.900 [get_ports {nand_if_7_nand_ce[*]}]
set_output_delay -clock [get_clocks nand_ch7_weo_clk] 0.900 [get_ports nand_if_7_nand_ale]
set_output_delay -clock [get_clocks nand_ch7_weo_clk] 0.900 [get_ports nand_if_7_nand_cle]
set_output_delay -clock [get_clocks nand_ch7_weo_clk] 0.900 [get_ports {nand_if_7_nand_dq[*]}]
#set_multicycle_path -setup -start -from [get_clocks nand_ch7_weo_clk] -to [get_clocks pll_bank35_nand_phy_clk] 2
#set_multicycle_path -hold -start -from [get_clocks nand_ch7_weo_clk] -to [get_clocks pll_bank35_nand_phy_clk] 1
set_false_path -setup -fall_from pll_bank35_nand_phy_clk -rise_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -setup -fall_from pll_bank35_nand_phy_clk -fall_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -hold -fall_from pll_bank35_nand_phy_clk -rise_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -hold -fall_from pll_bank35_nand_phy_clk -fall_to [get_clocks nand_ch7_dqs_as_clk]
set_false_path -setup -fall_from pll_bank35_nand_phy_clk -rise_to [get_clocks nand_ch7_weo_clk]
set_false_path -setup -fall_from pll_bank35_nand_phy_clk -fall_to [get_clocks nand_ch7_weo_clk]
set_false_path -hold -fall_from pll_bank35_nand_phy_clk -rise_to [get_clocks nand_ch7_weo_clk]
set_false_path -hold -fall_from pll_bank35_nand_phy_clk -fall_to [get_clocks nand_ch7_weo_clk]
set_property IODELAY_GROUP BANK_7_IODELAY_GROUP [get_cells sys_top_i/v2nfc_7/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAYCTRL]
set_property IODELAY_GROUP BANK_7_IODELAY_GROUP [get_cells sys_top_i/v2nfc_7/inst/Inst_NPhy_Toggle_Top/Inst_NPhy_Toggle_Physical_Input/Inst_DQSIDELAY]

